#Revisión general de los datos.

In [1]:
#Tratamiento y exportación de datos
#importamos librerias
import pandas as pd    # Librería para tablas y tratamiento de datos.
#Para una visualización completa de todas las columnas:
pd.set_option('display.max_columns', None)

In [2]:

df_clientes=pd.read_csv('clientes.csv')
df_clientes.sample(5)

    id_cliente  nombre   apellido             ciudad
5        C0006   Elena      López    Braga, Portugal
299      C0300  Carmen      Pérez   Aveiro, Portugal
21       C0022   María  Rodríguez   Aveiro, Portugal
58       C0059  Carmen    Sánchez    Sevilla, España
122      C0123     Ana   González  Toulouse, Francia

In [3]:
df_clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_cliente  300 non-null    object
 1   nombre      300 non-null    object
 2   apellido    300 non-null    object
 3   ciudad      300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [13]:
df_clientes.duplicated().sum()

0

In [4]:
df_productos=pd.read_csv('productos.csv')
df_productos.sample(5)

,id_producto,precio,categoria,descripcion
554,P0555,64.37 €,Books,NRiNdUaFhdL1wI2eDd7tzW29bMcogzbp3chVrCyph60jLu...
425,P0426,55.63 €,Electronics,aiK5iNl6oi5VktIIWD42bECYuU8wMjcX4ZodxdhLhB5BLd...
461,P0462,1.26 €,Books,0qPyzOBFfd3oKM4MHgu0P10A4ZLqyLyKPzLZPrUQWrmO6T...
268,P0269,74.18 €,Home & Kitchen,ZPhbmFr3PyFOnFPlEKIWH4ZD10oIoX8Voqis8479iNsKVV...
433,P0434,70.52 €,Clothing,wcK3tVDpAv0p8vvW4GNPVyaYjpEs0FyrVRyEeNktmSviY1...

In [14]:
df_productos.duplicated().sum()

0

In [5]:
df_productos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_producto  600 non-null    object
 1   precio       600 non-null    object
 2   categoria    600 non-null    object
 3   descripcion  600 non-null    object
dtypes: object(4)
memory usage: 18.9+ KB

In [6]:
df_ventas=pd.read_csv('ventas.csv')
df_ventas.sample(5)

      id_venta id_producto  cantidad       fecha id_cliente
55683  V004084       P0040         5  2023-05-24      C0076
76165  V002669       P0258         6  2021-01-23      C0211
41479  V000658       P0003         7  2022-07-18      C0248
53978  V000069       P0163         4  2021-01-27      C0074
7166   V005240       P0180         8  2023-10-12      C0067

In [7]:
df_ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_venta     80000 non-null  object
 1   id_producto  80000 non-null  object
 2   cantidad     80000 non-null  int64
 3   fecha        80000 non-null  object
 4   id_cliente   80000 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.1+ MB

In [16]:
df_ventas.duplicated().sum()

80

Pasaremos todos los datos a un solo dataframe:

In [26]:
merge1_dfs=df_ventas.merge(df_clientes, on ="id_cliente")

In [27]:
merge1_dfs.head()

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad
0,V004849,P0173,4,2024-05-16,C0203,Lucía,González,"Niza, Francia"
1,V003181,P0165,9,2022-09-12,C0004,Marta,López,"Valencia, España"
2,V000311,P0194,10,2020-12-02,C0156,Sofía,Sánchez,"Santander, España"
3,V002787,P0167,1,2023-07-22,C0058,Clara,Hernández,"Barcelona, España"
4,V002726,P0417,10,2022-04-10,C0099,Elena,García,"Lisboa, Portugal"

In [28]:
merge2_dfs=merge1_dfs.merge(df_productos, on="id_producto")

In [29]:
merge2_dfs.head()

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad,precio,categoria,descripcion
0,V004849,P0173,4,2024-05-16,C0203,Lucía,González,"Niza, Francia",58.91 €,Books,UASpWkt14nzeB6fkBDwO42wQiCijnSTcizwW1eB1yy0Rmy...
1,V003181,P0165,9,2022-09-12,C0004,Marta,López,"Valencia, España",93.20 €,Books,Wk3wS8V6kUhy0nWnknaaSiS3oQJkfAf8pOK0GAbRqMwQ3L...
2,V000311,P0194,10,2020-12-02,C0156,Sofía,Sánchez,"Santander, España",43.38 €,Clothing,eOnRpP74GAXrDk8UMb6QgmSJscSgpT9B5B9C1PA1TB9Xc5...
3,V002787,P0167,1,2023-07-22,C0058,Clara,Hernández,"Barcelona, España",88.17 €,Sports & Outdoors,y8Efq93OmWZtzYYgcAN3Mw5xQmiwA0hj7AIzQ8Mqba5oYK...
4,V002726,P0417,10,2022-04-10,C0099,Elena,García,"Lisboa, Portugal",60.69 €,Books,EmQk26vUd7mOMAKQHwUVk1Qm4rwUZC1vHOBk9pqI565P7v...

In [30]:
merge2_dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_venta     80000 non-null  object
 1   id_producto  80000 non-null  object
 2   cantidad     80000 non-null  int64
 3   fecha        80000 non-null  object
 4   id_cliente   80000 non-null  object
 5   nombre       80000 non-null  object
 6   apellido     80000 non-null  object
 7   ciudad       80000 non-null  object
 8   precio       80000 non-null  object
 9   categoria    80000 non-null  object
 10  descripcion  80000 non-null  object
dtypes: int64(1), object(10)
memory usage: 6.7+ MB

In [31]:
#Vamos a separarcolumnas siguiendo el proceso de normalizacion de una tabla:
#Separaremos la columna ciudad en dos: ciudad y país.
merge2_dfs[['ciudad','pais']]=merge2_dfs.ciudad.str.split(', ', expand=True)
merge2_dfs.head(1)

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad,precio,categoria,descripcion,pais
0,V004849,P0173,4,2024-05-16,C0203,Lucía,González,Niza,58.91 €,Books,UASpWkt14nzeB6fkBDwO42wQiCijnSTcizwW1eB1yy0Rmy...,Francia

In [33]:
#separaremos '€' de la columna precios y ccambiaremos su tipo de valor a float.
merge2_dfs.precio=merge2_dfs.precio.str.replace('€','')
merge2_dfs.head(1)

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad,precio,categoria,descripcion,pais
0,V004849,P0173,4,2024-05-16,C0203,Lucía,González,Niza,58.91,Books,UASpWkt14nzeB6fkBDwO42wQiCijnSTcizwW1eB1yy0Rmy...,Francia

In [34]:
merge2_dfs.precio=merge2_dfs.precio.astype(float)

In [36]:
merge2_dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_venta     80000 non-null  object
 1   id_producto  80000 non-null  object
 2   cantidad     80000 non-null  int64
 3   fecha        80000 non-null  object
 4   id_cliente   80000 non-null  object
 5   nombre       80000 non-null  object
 6   apellido     80000 non-null  object
 7   ciudad       80000 non-null  object
 8   precio       80000 non-null  float64
 9   categoria    80000 non-null  object
 10  descripcion  80000 non-null  object
 11  pais         80000 non-null  object
dtypes: float64(1), int64(1), object(10)
memory usage: 7.3+ MB

In [37]:
#Procedemos a guardar el df _limpio:
merge2_dfs.to_csv('clientes_productos_ventas.csv')